{
    "meta": {
        "id": "db862c5b-c594-4480-9e0c-86a14f71cf0e",
        "node": "us-east4",
        "ms": 386
    },
    "data": [
        {
            "t": 0,
            "rank": 1,
            "url": "http://minimsft.blogspot.com/2011/01/microsoft-fy11q2-results.html",
            "title": "Mini-Microsoft: Microsoft FY11Q2 Results",
            "snippet": "Like I said, there&#39;s a big convergence ahead of us, and it will be good to start aligning a simpler development story, both for Microsoft and its partners. The biggest obvious concern is the development path for the mobile platform compared to the development path for Windows, but even there you can squint and see on the horizon the possibility for..",
            "published": "2011-01-01T00:00:00Z"
        },
        {
            "t": 0,
            "rank": 2,
            "url": "http://toastytech.com/guis/bob.html",
            "title": "Microsoft Bob",
            "snippet": "Microsoft Bob| Microsoft Bob And so Microsoft Bob disappeared in to obscurity."
        },
        {
            "t": 0,
            "rank": 3,
            "url": "https://microsoft.github.io/tilecode/",
            "title": "Microsoft TileCode",
            "snippet": null
        },
        {
            "t": 0,
            "rank": 4,
            "url": "https://docs.microsoft.com/en-us/learn/?WT.mc_id=sitertzn_homepage_mslearn-redirect-mpp",
            "title": "Microsoft Learn | Microsoft Docs",
            "snippet": "Explore a topic in-depth through guided paths or learn how to accomplish a specific task through individual modules. Welcome to Microsoft Learn Whether you&#39;re just starting or an experienced professional, our hands-on approach helps you arrive at your goals faster, with more confidence and at your own pace."
        },
        {
            "t": 0,
            "rank": 5,
            "url": "http://www.glassdoor.com/Reviews/Microsoft-Reviews-E1651.htm",
            "title": "Microsoft Reviews",
            "snippet": "Check out the 2012 Vanity Fair article called &quot;Microsoft&#39;s Lost Decade&quot;.Continue readingFormer Employee, more than 8 yearsProsMicrosoft takes great care of their people, the benefits are some of the best in tech, you can take pretty much all the PTO you want regardless of what you&#39;re actually rewarded, the annual perks are really great and the bonu.."
        },
        {
            "t": 0,
            "rank": 6,
            "url": "https://web.archive.org/web/20090831071455/http://blogs.msdn.com/oneapp/archive/2009/08/24/microsoft-introducing-oneapp.aspx",
            "title": "Microsoft OneApp : Microsoft Introducing OneApp",
            "snippet": "I am excited to introduce to you Microsoft OneApp, a new software application that will allow feature phones to run mobile apps like Facebook, Twitter, Windows Live Messenger, and other popular applications and games. Our hope is that OneApp will develop new business opportunities for partners like Blue Label Telecoms and create more opportunities ..",
            "published": "2009-08-31T07:14:55Z"
        },
        {
            "t": 0,
            "rank": 7,
            "url": "http://minimsft.blogspot.com/2012/11/a-microsoft-without-sinofsky.html",
            "title": "Mini-Microsoft: A Microsoft Without Sinofsky?",
            "snippet": "Mr. Sinofsky got a standing ovation from the Windows team during the Company Meeting for all that he&#39;s done to take them on a multi-year journey to create Windows 7 and then hit the big multi-division reset button for Windows 8. He truly demonstrated technical leadership at its best. Meanwhile, Ms. Larson-Green: best of luck following this act.",
            "published": "2012-11-01T00:00:00Z"
        },
        {
            "t": 0,
            "rank": 8,
            "url": "https://developer.microsoft.com/en-us/",
            "title": "Microsoft Developer",
            "snippet": "Build collaborative solutions with Microsoft Graph, Microsoft Viva, Office 365, SharePoint, and more. Extend and customize the Microsoft Teams platform to create and connect apps and workflows. Whether you&#39;re just starting or an experienced professional, our hands-on approach helps you arrive at your goals faster, with more confidence and at your o.."
        },
        {
            "t": 0,
            "rank": 9,
            "url": "https://en.wikipedia.org/wiki/Microsoft",
            "title": "Microsoft - Wikipedia",
            "snippet": "9] This unfolded with Microsoft acquiring Danger Inc. in 2008,[10] entering the personal computer production market for the first time in June 2012 with the launch of the Microsoft Surface line of tablet computers, and later forming Microsoft Mobile through the acquisition of Nokia&#39;s devices and services division. In 1990, Microsoft introduced the .."
        },
        {
            "t": 0,
            "rank": 10,
            "url": "https://slack.com/blog/news/dear-microsoft#.3wj6j4611",
            "title": "Dear Microsoft | Slack",
            "snippet": null
        },
        {
            "t": 0,
            "rank": 11,
            "url": "http://minimsft.blogspot.com/2010/09/microsoft-company-meeting-2010.html?showComment=1285836102916#c2255289100235206673",
            "title": "Mini-Microsoft: Microsoft Company Meeting 2010",
            "snippet": "Then all of a sudden, I&#39;m A10 and told its not performance but because everyone in my team is over 63 - so they gave me a good review - good bonus and A/10. Here&#39;s a hint for the folks that create the company meeting: If you can&#39;t get first rate talent for a good price, then don&#39;t waste the money on a host and put cookies back in the box lunches an..",
            "published": "2010-09-01T00:00:00Z"
        },
        {
            "t": 0,
            "rank": 12,
            "url": "https://github.com/Microsoft/GraphEngine",
            "title": "GitHub - microsoft/GraphEngine: Microsoft Graph Engine",
            "snippet": "Microsoft Graph Engine is a distributed in-memory data processing engine, underpinned by a strongly-typed in-memory key-value store and a general-purpose distributed computation engine. It combines the capability of fast graph exploration with the flexibility of lambda expression. If you are interested in contributing to Graph Engine, please fork t.."
        },
        {
            "t": 0,
            "rank": 13,
            "url": "http://www.cs.toronto.edu/~wayne/microsoft-sucks.html",
            "title": "Microsoft Sucks",
            "snippet": "http://www.microsoft.com/java/sdk/getstart/javac007.htm : Updating the Java Support on a User&#39;s Machine If you are placing an applet that uses COM on an HTML page accessible from the Internet, you must ensure that any users who encounter that page have a version of the Java Support for Internet Explorer that fully supports Java/COM integration. As .."
        },
        {
            "t": 0,
            "rank": 14,
            "url": "http://minimsft.blogspot.com/2010/09/microsoft-annual-review-2010.html",
            "title": "Mini-Microsoft: Microsoft Annual Review 2010",
            "snippet": "Just a quick post: some of you enjoy posting information relevant to your review, both looking at numbers and a critical view of the message given to you. It has started to happen a bit in the last post (I&#39;m going through the comments now) so I&#39;m just going to capitulate (again) and put this small post up for the 2010 Annual Review share and compar..",
            "published": "2010-09-01T00:00:00Z"
        },
        {
            "t": 0,
            "rank": 15,
            "url": "http://techrights.org/comes-vs-microsoft/text/msg00176.html",
            "title": "Microsoft Confidential ..",
            "snippet": "Lotus, Word Perfect and Borland poised to introduce their key Windows apps this FY and IBM pushing OS/2 2.0 as the new standard through newly formed alliances, it is time to analyze the MS OEM situation and give you some advice in how to win during the years to come. In understanding this best, MS convinced IBM to change the OS/2 development method.."
        },
        {
            "t": 0,
            "rank": 16,
            "url": "https://github.com/microsoft/buildxl",
            "title": "GitHub - microsoft/BuildXL: Microsoft Build Accelerator",
            "snippet": "BuildXL (Microsoft Build Accelerator) BuildXL (Microsoft Build Accelerator), is a build engine originally developed for large internal teams at Microsoft. Internally at Microsoft, BuildXL runs 150,000+ builds per day on monorepo codebases up to a half-terabyte in size with a half-million process executions per build."
        },
        {
            "t": 0,
            "rank": 17,
            "url": "https://www.microsoft.com/en-us/microsoft-365/blog/2016/11/02/introducing-microsoft-teams-the-chat-based-workspace-in-office-365/",
            "title": "Microsoft Introduces Slack Competitor, Microsoft Teams",
            "snippet": "Microsoft Teams delivers on four core promises to create a digital workspace for high performing teams. Backed by the Microsoft Graph, intelligent services are surfaced throughout the workspace to help with information relevancy, discovery and sharing. Microsoft Teams is also built on Office 365 Groups—our cross-application membership service that ..",
            "published": "2016-11-02T00:00:00Z"
        },
        {
            "t": 0,
            "rank": 18,
            "url": "https://github.com/MicrosoftEdge/MSEdge",
            "title": "GitHub - MicrosoftEdge/MSEdge: Microsoft Edge",
            "snippet": "In that context, we have been thinking through plans to adopt the Chromium open source project in the development of Microsoft Edge on the desktop to create better web-compatibility for our customers and less fragmentation of the web for all its developers, and we’re now ready to move forward. As part of this, we hope and intend to become a signifi.."
        },
        {
            "t": 0,
            "rank": 19,
            "url": "http://microsoftjobsblog.com/blog/7-reasons-to-hack---hackathons-help-you-build-your-network",
            "title": "People of Microsoft - Home - Microsoft Life",
            "snippet": "Brittany Valdes struggled to find her place between two sometimes conflicting identities: motherhood and professional life. I want to help others get a little bit closer to their own dreams.” Huong Haley, the daughter of a Vietnamese prisoner of war, speaks up about how her background—which she identifies as “first generation, low income”—surfaced .."
        },
        {
            "t": 0,
            "rank": 20,
            "url": "http://marginalrevolution.com/marginalrevolution/2012/03/microsoft-help.html",
            "title": "Microsoft Help - Marginal REVOLUTION",
            "snippet": "The trackpad: Ok, I agree, but most people who talk about how mac&#39;s are garbage aren&#39;t bothering with track pads, mice are much more accurate, more ergonomic, and faster. The screen: I&#39;ve never had a viewing angle problem, and once again, advanced users often have non-built in screens, in which case it&#39;s possible to get much higher quality screens ..",
            "published": "2012-03-01T00:00:00Z"
        },
        {
            "t": 0,
            "rank": 21,
            "url": "https://www.microsoft.com/en-us/microsoft-365/outlook/outlook-for-business",
            "title": "Microsoft Outlook for business - Microsoft",
            "snippet": "Get peace of mind with enterprise-grade security trusted by many of the world’s largest organizations. Travel and bill payments are automatically added to your calendar, and intelligent reminders help keep you on track. Previous versions include Outlook 2013, Outlook 2010, and Outlook 2007."
        },
        {
            "t": 0,
            "rank": 22,
            "url": "https://web.archive.org/web/20160312024026/https://medium.com/i-m-h-o/microsoft-heres-my-offer-80f979fdd692",
            "title": "Microsoft, here's my offer. -- I. M. H. O. -- Medium",
            "snippet": "You are close to 100.000 people strong, that’s 100.000 of the world’s most creative, smart, passionate spirits, willing to make it the best brand with the best range of products in the world. Hire me and let me compile you a list of things that are so terrible that I feel in no position to defend you anymore. Visual Studio kicks ass, the distributi..",
            "published": "2016-03-12T02:40:26Z"
        },
        {
            "t": 0,
            "rank": 23,
            "url": "https://www.windowscentral.com/microsoft",
            "title": "Microsoft | Windows Central",
            "snippet": "Traditionally a software company at heart, Microsoft dabbled in hardware with computing peripherals like mice and keyboards before going all in with the Surface line of tablets. Most consumers are familiar with Microsoft through their operating system Windows, their office software suite Microsoft Office, their home entertainment consoles Xbox, and.."
        },
        {
            "t": 0,
            "rank": 24,
            "url": "https://github.com/microsoft/microsoft-ui-xaml/blob/main/docs/roadmap.md",
            "title": "microsoft-ui-xaml/roadmap.md at main * microsoft/microsoft-ui-xaml * GitHub",
            "snippet": "WinUI is under active development by the Windows developer platform team and the roadmap will continue to evolve based on market changes and customer feedback, so please note that the plans outlined here aren&#39;t exhaustive or guaranteed. WinUI provides a number of benefits which makes it the best way to create user interfaces for Windows apps: Creat.."
        },
        {
            "t": 0,
            "rank": 25,
            "url": "http://www.minimallyminimal.com/blog/2012/7/3/the-next-microsoft.html",
            "title": "The Next Microsoft -- Minimally Minimal",
            "snippet": null,
            "published": "2012-07-03T00:00:00Z"
        },
        {
            "t": 0,
            "rank": 26,
            "url": "https://xkcd.com/1118/",
            "title": "xkcd: Microsoft",
            "snippet": "Title text: Facebook, Apple, and Google all got away with their monopolist power grabs because they don&#39;t have any &#39;S&#39;s in their names for critics to snarkily replace with &#39;$&#39;s.}} xkcd.com is best viewed with Netscape Navigator 4.0 or below on a Pentium 3±1 emulated in Javascript on an Apple IIGS at a screen resolution of 1024x1. Please enable your.."
        },
        {
            "t": 0,
            "rank": 27,
            "url": "https://www.microsoft.com/en-us/microsoft-365/blog/2016/06/06/microsoft-planner-ready-for-showtime/",
            "title": "Microsoft Planner",
            "snippet": "With Planner, teams can create new plans; organize, assign and collaborate on tasks; set due dates; update statuses and share files, while visual dashboards and email notifications keep everyone informed on progress. The firm recently adopted Planner to help team members in multiple offices manage client engagements in a more organized and collabor..",
            "published": "2016-06-06T00:00:00Z"
        },
        {
            "t": 0,
            "rank": 28,
            "url": "https://web.archive.org/web/20201108115652/https://m.signalvnoise.com/microsoft--i-forgive-you/",
            "title": "Microsoft, I forgive you! - Signal v. Noise",
            "snippet": "And perversely enough, that’s exactly what is setting it free to try harder, try again, and make an impression with a crowd that’s no longer dispositioned to reject the effort because Microsoft is the big bad wolf. It’s bizarre, but I actually want to see a resurgent, strong Microsoft. Yes, I know they’ve been pining for it, so here it is: Microsof..",
            "published": "2020-11-08T11:56:52Z"
        }
    ]
}
